package com.example.onedayhobby;

import java.util.ArrayList;

public class HobbyData {

    ArrayList<HobbyItem> hobbyItems = new ArrayList<>();

    public HobbyData(){

        hobbyItems.add(new HobbyItem(R.drawable.hobby01, "식물 키우기", "정신건강에 좋은 식물 키우기",
                "준비물\n   모종삽, 분무기, 화분 받침대, 원예용 가위 등\n" +
                        "\n장점\n" +
                        "  - 정신건장에 좋습니다.\n" +
                        "  - 공기를 정화합니다.\n" +
                        "  - 실내의 습도 조절이 됩니다.\n" +
                        "  - 인테리어 효과를 줄 수 있습니다.\n" +
                        "\n방법\n   키우는 식물의 특성에 따라 햇빛, 물, 온도,\n   환기 등을 잘 조절해주어야 합니다. \n" +
                        "\n주의사항\n   자신한테 맞는 식물을 골라야 하며, 빛, 온도,\n   물 주기, 환기가 매우 중요합니다. "));
        hobbyItems.add(new HobbyItem(R.drawable.hobby02, "캠핑", "함께 힐링하는 캠핑",
                "준비물\n   텐트, 테이블, 의자, 차량용냉장고,\n   조리기구, 화로대, 랜턴, 침낭, 버너\n" +
                        "\n장점\n" +
                        "  - 사람들과 함께 할 수 있습니다.\n" +
                        "  - 자연을 체험할 수 있습니다.\n" +
                        "  - 힐링을 할수 있습니다.\n" +
                        "\n방법\n   계획을 세우며 캠핑장을 선택하고 예약하며\n   필요물품을 준비합니다\n" +
                        "\n주의사항\n   벌레 조심, 화재사고 조심, 체온 조절 필수"));
        hobbyItems.add(new HobbyItem(R.drawable.hobby03, "걷기 운동", "가장 쉽고 건강한 운동",
                "준비물\n   운동화, 모자, 손수건, 선크림 등\n" +
                        "\n장점\n" +
                        "  - 신체 회복시간을 줄일 수 있습니다.\n" +
                        "  - 심장병 예방 효과가 있습니다.\n" +
                        "  - 노화로 인한 기억장애 개선에 도움을 줍니다.\n" +
                        "  - 스트레스 해소 또는 숙면에 도움을 줍니다.\n" +
                        "\n방법\n   평소 속도보다 빠르게 걸으면서\n   적당한 속도를 유지합니다.\n   팔을 흔들면 상체 운동에도 도움이 됩니다. \n" +
                        "\n주의사항\n   준비운동은 필수이며 편한 신발과\n   바른 자세가 중요합니다."));
        hobbyItems.add(new HobbyItem(R.drawable.hobby04, "등산", "자연을 즐길 수 있는 등산",
                "준비물\n   등산화, 등산복, 모자, 배낭, 스틱, 물, 간식,\n   장갑, 발목양말, 개인물품\n" +
                        "\n장점\n" +
                        "  - 심폐 기능 향상 및 골밀도, 체력,\n    근지구력 향상에 도움을 줍니다. \n" +
                        "  - 작은 성취감으로 큰 만족감을\n    느낄 수 있습니다.\n" +
                        "  - 다양한 사람들을 만나볼 수 있습니다.\n" +
                        "  - 각종 질병이 예방됩니다.\n" +
                        "  - 정신건강에 좋습니다.\n" +
                        "\n방법\n   집 근처 가까운 산을 시작으로 규칙적로\n   산행하며 첨차 거리와 시간과\n   속도를 올려갑니다.\n" +
                        "\n주의사항\n   당뇨질환자나고혈압이나, 호흡기 질환자 등은\n   산행을 해서는 안됩니다.\n   또한 산속에서 위험상황시 대처 방법을\n   알고 있어야 합니다. "));
        hobbyItems.add(new HobbyItem(R.drawable.hobby05, "십자수", "집중력 향상에 좋은 십자수",
                "준비물\n   실, 스티커, 십자수 바늘, 도안,\n   천, 가위, 자수틀 등\n" +
                        "\n장점: \n" +
                        "  - 배우기 쉽습니다.\n" +
                        "  - 보관 및 관리가 편리합니다.\n" +
                        "  - 성취감을 느낄수 있습니다.\n" +
                        "  - 집중력을 높일 수 있습니다.\n" +
                        "  - 장소제약이 없습니다.\n" +
                        "\n방법\n   사용설명서가 있으며 왼쪽에서 오른쪽으로\n   수를 놓으며 다양한 방법으로 수를\n   놓을 수 있습니다. \n" +
                        "\n주의사항\n   실의 길이를 잘 조절해야 하며\n   수를 한 방향으로 놓아야 합니다. "));
        hobbyItems.add(new HobbyItem(R.drawable.hobby06, "레진 공예", "인지 발달을 유발하는 레진 공예",
                "준비물(기본)\n   레진, 몰드, 핀셋, 이쑤시개,\n   악세사리부자재, 투명필름\n" +
                        "\n장점\n" +
                        "  - 초보자도 쉽게 만들 수 있습니다.\n" +
                        "  - 스트레스와 관련된 질환의 영향을\n    중화시킵니다.\n" +
                        "  - 뇌의 신경망에 자극을 주어 깊게\n    집중할 수 있도록 도웁니다. \n" +
                        "  - 우울증 중상을 줄입니다.\n" +
                        "  - 창의력을 키웁니다.\n" +
                        "  - 긴장을 완화시키는데 도움을 줍니다.\n" +
                        "  - 인지 발달을 유발합니다.\n" +
                        "  - 만든 공예품을 판매할 수도 있습니다.\n" +
                        "\n방법\n   만드는 모양에 따라 방법이 달라지며\n   많은 재료를 사용해서 나만의\n   레진공예를 할 수 있습니다.\n" +
                        "\n주의사항\n   레진의 양에 따라 경화시간을\n   잘 맞춰야 합니다. "));
        hobbyItems.add(new HobbyItem(R.drawable.hobby07, "축구", "건강하고 재미있게 운동하기",
                "준비물\n   축구화, 축구공, 보호대, 유니폼\n" +
                        "\n장점\n" +
                        "  - 하체 근력을 강화해줍니다.\n" +
                        "  - 심폐지구력 능력 향상에 도움을 줍니다.\n" +
                        "  - 신경발달에 도움을 줍니다.\n" +
                        "  - 사교성과 협동심을 기를 수 있습니다.\n" +
                        "  - 다이어트에 도움이 됩니다.\n" +
                        "  - 체력을 길를 수 있습니다.\n" +
                        "\n방법\n   축구 규칙에 대해 알아야 됩니다.\n   팀과 함께 수비 또는 공격을 하면서\n   전반전, 후반전으로 각 45분, 총 90분의\n   경기를 하며 점수를 더 많이\n   얻은 팀이 승리하게 됩니다.  \n" +
                        "\n주의사항\n   부상이 발생할 수 있으므로\n   충분한 준비운동은 필수입니다. "));
        hobbyItems.add(new HobbyItem(R.drawable.hobby08, "퍼즐", "집중력과 두뇌발달에 좋은 퍼즐",
                "준비물\n   퍼즐\n" +
                        "\n장점\n" +
                        "  - 집중력을 기를 수 있습니다.\n" +
                        "  - 성취감을 느낄 수 있습니다.\n" +
                        "  - 손 조작 능력 및 뇌 기능을 높일 수 있습니다.\n" +
                        "  - 창의력을 기르는데 도움을 줍니다. \n" +
                        "  - 두뇌 발달에 도움이 됩니다. \n" +
                        "\n방법\n   그림이 그려져 있는 여러 개의\n   퍼즐 조각을 맞물리는 홈대로\n   끼워서 맞춥니다. \n" +
                        "\n주의사항\n   조각 수가 많을수록 난이도가 높고\n   시간도 오래 걸리기 때문에\n   자신에게 맞는 난이도를 선택해야 합니다. "));
        hobbyItems.add(new HobbyItem(R.drawable.hobby09, "요가", "몸을 유연하게 해주는 요가",
                "준비물\n   요가 매트, 요가복\n" +
                        "\n장점\n" +
                        "  - 소화력을 증진시킵니다.\n" +
                        "  - 균형감각을 기르는데 도움을 줍니다.\n" +
                        "  - 집중력을 향상시킵니다.\n" +
                        "  - 몸을 유연하게 합니다.\n" +
                        "  - 스트레스를 줄이는데 도움이 됩니다.\n" +
                        "  - 혈액순환이 증진됩니다.\n" +
                        "  - 인내심 향상에 도우을 줍니다.\n" +
                        "\n방법\n   동작에 따라 하는 법이 다릅니다. \n" +
                        "\n주의사항\n   어려운 동작은 반복하여 쉽게 자세를\n   유지할수 있도록 해야 하며\n   갈증을 느낄수 있으니 충분히 물을\n   마셔야 합니다. "));
        hobbyItems.add(new HobbyItem(R.drawable.hobby10, "여행", "새로운 문화를 접해보는 여행",
                "준비물\n   여권, 현지 화페, 비상약, 그 밖에 개인용품\n" +
                        "\n장점\n" +
                        "  - 새로운 문화를 접할 수 있습니다\n" +
                        "  - 자신감을 얻을 수 있습니다.\n" +
                        "  - 다양한 국적의 사람들을 만나볼 수 있습니다.\n" +
                        "  - 지식을 쌓을 수 있습니다.\n" +
                        "  - 모험심을 기를 수 있습니다.\n" +
                        "  - 문제해결 능력을 기를 수 있습니다.\n" +
                        "  - 시야를 넗히는데 도움을 줍니다.\n" +
                        "\n방법\n   자신만의 테마를 찾고 기록을 남기면\n   즐거운 여행을 할수 있습니다. \n" +
                        "\n주의사항\n   위험한 장소나 비상상황에 대처법을\n   숙지해야되며 소지품 관리에 주의해야\n   합니다.  "));
    }
    public ArrayList<HobbyItem> getHobbyItems(){
        return hobbyItems;
    }
}
